---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CutLineExtension
source: html/d12b3dc3-91f4-f15a-3e56-0c947b1c6343.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CutLineExtension Property

"Cut Line Extension"

## Syntax (C#)
```csharp
public static ForgeTypeId CutLineExtension { get; }
```